import { MockData } from "@/types/event-types";


const mockData: MockData = [
  {
    category: "Кино",
    events: [
      {
        year: 1986,
        description: 'Премьера фильма "Чужие" режиссёра Джеймса Кэмерона.',
      },
      { year: 1987, description: 'Премьера культового фильма "Робокоп".' },
      {
        year: 1988,
        description:
          'Выход анимационного фильма "Кто подставил кролика Роджера".',
      },
      {
        year: 1989,
        description: 'Премьера фильма "Бэтмен" режиссёра Тима Бёртона.',
      },
      { year: 1990, description: 'Выход на экраны фильма "Один дома".' },
    ],
  },
  {
    category: "Музыка",
    events: [
      { year: 1991, description: 'Релиз альбома "Nevermind" группы Nirvana.' },
      {
        year: 1992,
        description: 'Премьера хита "Black or White" Майкла Джексона.',
      },
      { year: 1993, description: "Начало гастрольного тура U2 Zoo TV." },
      { year: 1994, description: 'Выход альбома "Dookie" группы Green Day.' },
      { year: 1995, description: "Концерт Live Aid 10-летия." },
    ],
  },
  {
    category: "Наука",
    events: [
      {
        year: 1996,
        description:
          'Телескоп "Хаббл" обнаружил самую удалённую галактику GN-z11.',
      },
      {
        year: 1997,
        description:
          "Первый успешный клонированный млекопитающий — овечка Долли.",
      },
      {
        year: 1998,
        description:
          "Начало строительства Международной космической станции (МКС).",
      },
      {
        year: 1999,
        description: "Открытие первой экзопланеты в обитаемой зоне.",
      },
      {
        year: 2000,
        description: "Публикация полной последовательности генома человека.",
      },
    ],
  },
  {
    category: "Литература",
    events: [
      {
        year: 2001,
        description:
          'Выход романа "Гарри Поттер и философский камень" Дж. К. Роулинг.',
      },
      { year: 2002, description: 'Публикация романа "Жизнь Пи" Яна Мартела.' },
      {
        year: 2003,
        description:
          'Выход последней книги трилогии "Властелин колец" в новом переводе.',
      },
      {
        year: 2004,
        description: 'Публикация романа "Код да Винчи" Дэна Брауна.',
      },
      {
        year: 2005,
        description: 'Выход романа "Шантарам" Грегори Дэвида Робертса.',
      },
    ],
  },
  {
    category: "Технологии",
    events: [
      { year: 2006, description: "Запуск первого iPhone компанией Apple." },
      { year: 2007, description: "Основание компании Dropbox." },
      { year: 2008, description: "Запуск первой версии Android." },
      {
        year: 2009,
        description: "Открытие технологии CRISPR для редактирования генома.",
      },
      {
        year: 2010,
        description: "Появление планшетов как массового устройства (iPad).",
      },
    ],
  },
  {
    category: "Спорт",
    events: [
      {
        year: 2011,
        description:
          "Победа сборной Японии на чемпионате мира по футболу среди женщин.",
      },
      { year: 2012, description: "Летние Олимпийские игры в Лондоне." },
      {
        year: 2013,
        description: "Рекордное выступление Юсейна Болта на чемпионате мира.",
      },
      {
        year: 2014,
        description: "Победа сборной Германии на чемпионате мира по футболу.",
      },
      {
        year: 2015,
        description: "Сборная Новой Зеландии стала чемпионом мира по регби.",
      },
    ],
  },
];

export default mockData;
